Repository: WoeUSB/WoeUSB-ng
Catalog: src/WoeUSB/locale/*/LC_MESSAGES/woeusb.po
Languages: sv

source: You need to specify installation type (--device or --partition)
sv: Du måste specificera installationstyp (--device eller --partition)

source: Warning: You are not running {0} as root!
sv: Varning! Du kör inte {0} som root!

source: Warning: This might be the reason of the following failure.
sv: Varning! Detta kan vara orsaken till följande fel.

source: Error: Unable to mount source filesystem
sv: Fel: Kunde inte montera källfilsystemet

source: Error: Unable to mount target filesystem
sv: Fel: Kunde inte montera målfilsystemet

source: Wiping all existing partition table and filesystem signatures in {0}
sv: Rensar alla befintliga partitionstabell- och filsystemsignaturer på {0}

source: Ensure that {0} is really wiped...
sv: Tillse att {0} verkligen är rensad...

source: Error: Partition is still detected after wiping all signatures, this indicates that the drive might be locked into readonly mode due to end of lifespan.
sv: Fel: Partitionen upptäcks fortfarande efter att alla signaturer har raderats, vilket indikerar att enheten kan vara låst i skrivskyddat läge på grund av slutet på livslängden.

source: Creating new partition table on {0}...
sv: Skapar ny partitionstabell på {0}...

source: Error: Currently GUID partition table is not supported.
sv: Fel: GUID-partitionstabellen stöds för närvarande inte.

source: Error: Partition table not supported.
sv: Fel: Partitionstabellen stöds inte.

source: Error: Filesystem not supported
sv: Fel: Filsystemet stöds inte

source: Creating target partition...
sv: Skapar målpartition...

source: FATAL: Illegal parted_mkpart_fs_type, please report bug.
sv: FATALT FEL: Olaglig parted_mkpart_fs_type, rapportera gärna felet.

source: FATAL: Shouldn't be here
sv: FATALT FEL: Skulle inte vara här

source: Warning: Unable to download UEFI:NTFS partition image from GitHub, installation skipped. Target device might not be bootable if the UEFI firmware doesn't support NTFS filesystem.
sv: Varning! Kan inte ladda ned UEFI:NTFS-partitionsavbildningen från GitHub, installationen har hoppats över. Målenheten kanske inte kan startas om UEFI-mjukvaran inte stöder NTFS-filsystem.

source: Mounting source filesystem...
sv: Monterar källfilsystem...

source: Error: Unable to create {0} mountpoint directory
sv: Fel: Kunde inte skapa monteringspunktskatalog {0}

source: Error: Unable to mount source media
sv: Fel: Kunde inte montera källmedia

source: Mounting target filesystem...
sv: Monterar målfilsystem...

source: Error: Unable to mount target media
sv: Fel: Kunde inte montera målmedia

source: Copying files from source media...
sv: Kopierar filer från källmedia...

source: Installing GRUB bootloader for legacy PC booting support...
sv: Installerar GRUB-bootloader för äldre PC-startstöd...

source: Installing custom GRUB config for legacy PC booting...
sv: Installerar anpassad GRUB-konfiguration för äldre PC-uppstart...

source: Unmounting and removing {0}...
sv: Avmonterar och tar bort {0}...

source: Warning: Unable to unmount filesystem.
sv: Varning! Kan inte avmontera filsystem.

source: Warning: Unable to remove source mountpoint
sv: Varning! Det går inte att ta bort källmonteringspunkten

source: Some mountpoints are not unmount/cleaned successfully and must be done manually
sv: Vissa monteringspunkter demonteras/rensas inte och detta måste göras manuellt

source: We unable to unmount target filesystem for you, please make sure target filesystem is unmounted before detaching to prevent data corruption
sv: Vi kan inte avmontera målfilsystemet åt dig, se till att målfilsystemet är avmonterat innan du kopplar ifrån för att förhindra dataskador.

source: Target device is busy, please make sure you unmount all filesystems on target device or shutdown the computer before detaching it.
sv: Målenheten är upptagen, tillse att du demonterat alla filsystem på målenheten eller stänger av datorn innan du tar bort den.

source: You may now safely detach the target device
sv: Du kan nu säkert ta bort målenheten

source: Done :)
sv: Klart! :)

source: The target device should be bootable now
sv: Målenheten skall vara startbar nu

source: Show all drives
sv: Visa alla enheter

source: Show all drives, even those not detected as USB stick.
sv: Visa alla enheter, även de som inte identifieras som USB-minne.

source: Set boot flag
sv: Ange boot-flagga

source: Sets boot flag after process of copying.
sv: Ställer in boot-flagga efter kopieringsprocessen.

source: Use NTFS
sv: Använd NTFS

source: Use NTFS instead of FAT. NOTE: NTFS seems to be slower than FAT.
sv: Använd NTFS istället för FAT. Notera att NTFS verkar vara långsammare än FAT.

source: Skip legacy grub bootloader
sv: Skippa GRUB-bootloader för äldre PC

source: &File
sv: &Arkiv

source: &Options
sv: A&lternativ

source: &Help
sv: &Hjälp

source: Source :
sv: Källa :

source: From a disk image (iso)
sv: Från en skivavbild (iso)

source: Please select a disk image
sv: Välj en skivavbild

source: From a CD/DVD drive
sv: Från en CD-/DVD-enhet

source: Target device :
sv: Målenhet :

source: Install
sv: Installera

source: Installing
sv: Installerar

source: Please wait...
sv: Vänta...

source: Are you sure you want to cancel the installation?
sv: Vill du verkligen avbryta installationen?

source: Cancel
sv: Avbryt

source: Installation succeeded!
sv: Installation slutförd!

source: Installation failed!
sv: Installation misslyckades!

source: About
sv: Om

source: Authors
sv: Utvecklare

source: Original WinUSB Developer
sv: Ursprunglig WinUSB-utvecklare

source: This file is part of WoeUSB-ng. WoeUSB-ng is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. WoeUSB-ng is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with WoeUSB-ng. If not, see <http://www.gnu.org/licenses/>.
sv: Denna fil är en del av WoeUSB-ng. WoeUSB-ng är fri mjukvara. Du kan återdistribuera och/eller ändra den under villkoren för GNU General Public License som publicerad av Free Software Foundation, antingen version 3 av licensen, eller (valfritt) någon senare version. WoeUSB-ng distribueras med hopp om användbarhet, men UTAN NÅGRA GARANTIER. Utan ens underförstådd garanti för SÄLJBARHET eller LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL. Se GNU General Public License för detaljerad info. Du bör ha fått en kopia av GNU General Public License tillsammans med WoeUSB-ng. Om inte, se <http://www.gnu.org/licenses/>.

source: License
sv: Licens

source: Error: {0} requires {1} command in the executable search path, but it is not found.
sv: Fel: {0} kräver kommandot {1} i den körbara sökvägen, men det hittas inte.

source: Error: mkdosfs/mkfs.msdos/mkfs.vfat/mkfs.fat command not found!
sv: Fel: Kommando för mkdosfs/mkfs.msdos/mkfs.vfat/mkfs.fat hittades inte!

source: Error: Please make sure that dosfstools is properly installed!
sv: Fel: Tillse att dosfstools är korrekt installerat!

source: Error: mkntfs command not found!
sv: Fel: Kommando för mkntfs hittades inte!

source: Error: Please make sure that ntfs-3g is properly installed!
sv: Fel: Tillse att ntfs-3g är korrekt installerat!

source: Error: grub-install or grub2-install command not found!
sv: Fel: Kommando för grub-install eller grub2-install hittades inte!

source: Error: Please make sure that GNU GRUB is properly installed!
sv: Fel: Tillse att GNU GRUB är korrekt installerat!

source: Error: Source media "{0}" not found or not a regular file or a block device file!
sv: Fel: Källmedia "{0}" hittades inte eller är ingen vanlig fil, eller en blockenhetsfil!

source: Error: Target media "{0}" is not a block device file!
sv: Fel: Målmedia "{0}" är inte en blockenhetsfil!

source: Error: Target media "{0}" is not an entire storage device!
sv: Fel: Målmedia "{0}" är inte en hel lagringsenhet!

source: Error: Target media "{0}" is not an partition!
sv: Fel: Målmedia "{0}" är inte en partition!

source: Info: Target device is {0}
sv: Info: Målenhet är {0}

source: Info: Target partition is {0}
sv: Info: Målpartition är {0}

source: Error: Source media is currently mounted, unmount the partition then try again
sv: Fel: Källmediet är för närvarande monterat, avmontera partitionen och försök sedan igen

source: Error: Target partition is currently mounted, unmount the partition then try again
sv: Fel: Målpartitionen är för närvarande monterad, avmontera partitionen och försök sedan igen

source: Error: Target device is currently busy, unmount all mounted partitions in target device then try again
sv: Fel: Målenheten är för närvarande upptagen, avmontera alla monterade partitioner på målenheten och försök sedan igen

source: Warining: File {0} in source image has exceed the FAT32 Filesystem 4GiB Single File Size Limitation, swiching to NTFS filesystem.
sv: Varning! Filen {0} i källavbilden har överskridit FAT32:s filsystembegränsning på 4GiB för enskilda filer, byter till NTFS-filsystem.

source: Refer: https://github.com/slacka/WoeUSB/wiki/Limitations#fat32-filesystem-4gib-single-file-size-limitation for more info.
sv: Se https://github.com/slacka/WoeUSB/wiki/Limitations#fat32-filesystem-4gib-single-file-size-limitation för mer information.

source: Error: Target filesystem not supported, currently supported filesystem: FAT, NTFS.
sv: Fel: Målfilsystemet stöds inte, filsystem som för närvarande stöds är FAT och NTFS.

source: Warning: Your device doesn't seems to have an UEFI:NTFS partition, UEFI booting will fail if the motherboard firmware itself doesn't support NTFS filesystem!
sv: Varning! Din enhet verkar inte ha en UEFI: NTFS-partition, UEFI-uppstart kommer att misslyckas om moderkortets mjukvara inte själv stöder NTFS-filsystem!

source: Info: You may recreate disk with an UEFI:NTFS partition by using the --device creation method
sv: Info: Du kan återskapa en disk med en UEFI:NTFS-partition med hjälp av metoden --device

source: Error: Not enough free space on target partition!
sv: Fel: Inte tillräckligt med ledigt utrymme på målpartitionen!

source: Error: We required {0}({1} bytes) but '{2}' only has {3}({4} bytes).
sv: Fel: Vi krävde {0} ({1} byte) men "{2}" har bara {3} ({4} byte).

source: Making system realize that partition table has changed...
sv: Får systemet att inse att partitionstabellen har förändrats...

source: Wait 3 seconds for block device nodes to populate...
sv: Vänta 3 sekunder tills blockenhetsnoder fyllts i...

source: Applying workaround for buggy motherboards that will ignore disks with no partitions with the boot flag toggled
sv: Tillämpar en lösning för buggiga moderkort som ignorerar diskar utan partitioner när boot-flaggan används.

source: Source media seems to be Windows 7-based with EFI support, applying workaround to make it support UEFI booting
sv: Källmedia verkar vara Windows 7-baserat med EFI-stöd, tillämpar därför en lösning för att det skall stödja UEFI-uppstart

source: DEBUG: Can't find efi directory, use {0}
sv: FELSÖKNING: Kan inte hitta efi-katalogen, använd {0}

source: DEBUG: {0} detected.
sv: FELSÖKNING: {0} har identifierats.

source: DEBUG: Can't find efi/boot directory, use
sv: FELSÖKNING: Kan inte hitta efi/boot-katalogen, använd

source: INFO: Detected existing EFI bootloader, workaround skipped.
sv: INFO: Identifierade befintlig EFI-bootloader, lösning hoppades över.
